In [1]:
import pandas as pd
import numpy as np

In [8]:
india_weather = pd.DataFrame({
    'city':['Bhopal','Indore','Mumbai'],
    'temperature':[45,50,39]
})
india_weather

us_weather = pd.DataFrame({
    'city':['NY','Chicago','SW'],
    'temperature':[48,30,39]})
us_weather

      city  temperature
0       NY           48
1  Chicago           30
2       SW           39

In [13]:
#concate perform when it want to do join colmn
pd.concat([india_weather,us_weather])

      city  temperature
0   Bhopal           45
1   Indore           50
2   Mumbai           39
0       NY           48
1  Chicago           30
2       SW           39

In [15]:
pd.concat([india_weather,us_weather],ignore_index=True) #if we dont want index then enable ignore_index

      city  temperature
0   Bhopal           45
1   Indore           50
2   Mumbai           39
3       NY           48
4  Chicago           30
5       SW           39

In [16]:
pd.concat([india_weather,us_weather],keys=['India','USA']) #if want to describe according to india and USA

            city  temperature
India 0   Bhopal           45
      1   Indore           50
      2   Mumbai           39
USA   0       NY           48
      1  Chicago           30
      2       SW           39

In [19]:
d1=india_weather = pd.DataFrame({
    'city':['Bhopal','Indore','Mumbai'],
    'temperature':[45,50,39]
})
d1

d2=us_weather = pd.DataFrame({
    'city':['NY','Chicago','SW'],
    'humidity':[48,30,39]})
d2
pd.merge(d1,d2,how='outer') #join based on outer join

      city  temperature  humidity
0   Bhopal         45.0       NaN
1   Indore         50.0       NaN
2   Mumbai         39.0       NaN
3       NY          NaN      48.0
4  Chicago          NaN      30.0
5       SW          NaN      39.0

In [20]:
pd.merge(d1,d2,how='right') #based on right

      city  temperature  humidity
0       NY          NaN        48
1  Chicago          NaN        30
2       SW          NaN        39

In [21]:
pd.merge(d1,d2,how='inner') #based on inner

Empty DataFrame
Columns: [city, temperature, humidity]
Index: []

In [22]:
pd.merge(d1,d2,how='outer',indicator=True) #here indicator is used to say if it merge left only and rightonly

      city  temperature  humidity      _merge
0   Bhopal         45.0       NaN   left_only
1   Indore         50.0       NaN   left_only
2   Mumbai         39.0       NaN   left_only
3       NY          NaN      48.0  right_only
4  Chicago          NaN      30.0  right_only
5       SW          NaN      39.0  right_only

In [1]:
pip install BeautfulSoup4

Collecting BeautfulSoup4
  ERROR: Could not find a version that satisfies the requirement BeautfulSoup4 (from versions: none)
ERROR: No matching distribution found for BeautfulSoup4
Note: you may need to restart the kernel to use updated packages.